<template>
  <div class="content-wrapper">

    <PreloaderColor v-if="loading"/>

    <template v-else>

      <div>
        <img class="img-fluid top-banner" :src="require('@/assets/image/city.jpg')" alt="">
      </div>

      <div class="container mb-3 mt-5">
        <div class="row mb-5">
          <h2 class="font-weight-bold mb-3 text-center w-100">О Кинотеатре</h2>

          <p class="text-center">
            Кинотеа́тр — общественное здание или его часть с оборудованием для публичной демонстрации кинофильмов [1].
            Главное помещение кинотеатра — зрительный зал с экраном большого размера и системой воспроизведения звука. В
            современных кинотеатрах система звуковоспроизведения состоит из нескольких громкоговорителей, обеспечивающих
            объёмный звук. Первые стационарные кинотеатры назывались в Российской Федерации «электротеатрами»[2].
          </p>

          <img class="img-thumbnail img-fluid about-image" src="@/assets/image/hall.jpg" alt="">
        </div>

        <div class="row mb-5">
          <h2 class="font-weight-bold mb-3 text-center w-100">Устройство Кинотеатра</h2>

          <p class="text-justify">
            В современных кинотеатрах часто имеется несколько зрительных залов, обязательна система кондиционирования
            воздуха, а современные звуковоспроизводящие системы состоят из множества раздельных звуковых каналов
            (подробнее см. Dolby Surround, Dolby Digital, THX). При проектировании зданий для кинотеатров одной из
            главных задач считается достижение наилучших акустических характеристик кинозала для качественного звучания.
            В кинотеатрах обычно также имеются фойе для зрителей, гардероб, буфет, служебные помещения. Ранее кинотеатры
            Советского Союза были довольно крупными и вмещали до 2500—4000 зрителей единовременно. В конце 1980-х годов
            в Советском Союзе насчитывалось более 5000 кинотеатров[8]. По другим данным в период развитого социализма в
            Советском Союзе было 4800 кинотеатров и 150 тысяч киноустановок в посёлках городского типа и сельской
            местности[9].

            Современные кинозалы рассчитаны на меньшее количество зрителей, обычно по 200—300 посадочных мест в одном
            кинозале. Часто это является следствием реконструкции крупных советских кинотеатров, разделённых на
            несколько мелких залов, заполнить которые гораздо легче. На 2008 год в Российской Федерации насчитывалось
            7111 кинотеатров, 5651 из которых находился в сельской местности[10]. Современным оборудованием в 2010 году
            было оснащено 847 российских кинотеатров, насчитывавших на тот момент 2324 кинозала.
          </p>

          <img class="img-thumbnail img-fluid about-image" src="@/assets/image/cinema-banner.jpg" alt="">
        </div>

        <div class="row mb-5">
          <h2 class="font-weight-bold mb-3 text-center w-100">Технологии кинопоказа</h2>

          <p class="text-justify">
            Киноустановка кинотеатра, использующего киноплёнку, состоит не менее, чем из двух кинопроекторов для обеспечения непрерывности демонстрации фильма. Каждый кинопроектор называется «постом» и все имеющиеся посты централизованно управляются специальной автоматизированной системой кинопоказа, обеспечивающей незаметность переходов между отдельными частями фильма для зрителя. Современные многозальные мультиплексы широко применяют бесперемоточные платтеры, позволяющие демонстрировать фильмы любой длительности одним постом без перезарядки. В сочетании с централизованным управлением кинозалами и высоким уровнем автоматизации кинопоказа это позволяет обслуживать весь мультиплекс одним киномехаником. Подавляющее большинство кинотеатров оснащаются кинопроекторами, рассчитанными на киноплёнку шириной 35 (99 % коммерческих кинотеатров мира (которые ещё не перешли на цифру) используют 35-мм киноплёнку, остальные 70 мм или IMAX формат или OMNIMAX).
          </p>
        </div>
      </div>

    </template>

  </div>
</template>

<script>
import PreloaderColor from "../../components/site/preloader/Preloader-color";

import server from '../../requests/admin/requests'
import {mapGetters} from "vuex";

export default {
  name: "siteAboutCinema",
  components: {PreloaderColor},
  data() {
    return {
      loading: true,
      aboutCinema: null
    }
  },
  methods: {
    async getAboutCinemaData() {
      this.aboutCinema = await server.getCurrentData('aboutCinema', 'Pages', this.currentLang)

      this.loading = false
    }
  },
  computed: {
    ...mapGetters(['currentLang'])
  },
  mounted() {
    this.getAboutCinemaData()
  }
}
</script>

<style scoped>
.top-banner {
  width: 100%;
  object-fit: cover;
  max-height: 560px;
}

.about-image {
  max-height: 460px;
  width: 100%;
  object-fit: cover;
}
</style>